tap "controlplaneio-fluxcd/tap"
tap "fluxcd/tap"
tap "go-task/tap"
tap "homebrew/bundle"
tap "k8sgpt-ai/k8sgpt"
tap "siderolabs/tap"
tap "utkuozdemir/pv-migrate"
# Simple, modern, secure file encryption
brew "age"
# B2 Cloud Storage Command-Line Tools
brew "b2-tools"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Securely send things from one computer to another
brew "croc"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Open-source GitLab command-line tool
brew "glab"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Docker Hub experimental CLI tool
brew "hub-tool"
# Configurable static site generator
brew "hugo"
# Dex to Java decompiler
brew "jadx"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Cross-platform library for audio I/O
brew "portaudio"
# Rsync for cloud storage
brew "rclone"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Editor of encrypted files
brew "sops"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Configuration helper for talos clusters
brew "talhelper"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Persistent volume migration plugin for Kubernetes
brew "utkuozdemir/pv-migrate/pv-migrate", link: false
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Persistent volume migration plugin for Kubernetes
cask "utkuozdemir/pv-migrate/pv-migrate", trusted: true
vscode "anthropic.claude-code"
vscode "apollographql.vscode-apollo"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "george-alisson.html-preview-vscode"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jinliming2.vscode-go-template"
vscode "mechatroner.rainbow-csv"
vscode "mitchdenny.ecdc"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtsmfm.vscode-stl-viewer"
vscode "openai.chatgpt"
vscode "ottojimb.quickchars"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ryu1kn.partial-diff"
vscode "signageos.signageos-vscode-sops"
vscode "smoore.yaml-path"
vscode "stringham.move-ts"
vscode "tamasfe.even-better-toml"
vscode "weaveworks.vscode-gitops-tools"
vscode "wix.glean"
vscode "yzhang.markdown-all-in-one"
go "github.com/rhysd/actionlint/cmd/actionlint"
go "github.com/google/go-containerregistry/cmd/crane"
go "github.com/cloudflare/cloudflare-go/cmd/flarectl"
go "golang.org/x/tools/gopls"
go "github.com/goreleaser/goreleaser/v2"
go "github.com/grafana/mcp-grafana/cmd/mcp-grafana"
go "github.com/packwiz/packwiz"
go "github.com/GlebYaltchik/sc-keybind-extract"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/wailsapp/wails/v2/cmd/wails"
cargo "apkeep"
cargo "destructive_command_guard"
cargo "wasm-pack"
winget "3Dconnexion.3DxWare.10"
winget "7zip.7zip"
winget "Adobe.CreativeCloud"
winget "AgileBits.1Password"
winget "Amazon.Kindle"
winget "Amazon.KindlePreviewer"
winget "Anthropic.Claude"
winget "AnyAssociation.Anytype"
winget "AnyDesk.AnyDesk"
winget "Audacity.Audacity"
winget "Balena.Etcher"
winget "Bambulab.Bambustudio"
winget "beekeeper-studio.beekeeper-studio"
winget "BellSoft.LibericaJDK.17"
winget "BlenderFoundation.Blender"
winget "calibre.calibre"
winget "CloudImperiumGames.RSILauncher"
winget "Corsair.iCUE.5"
winget "CPUID.CPU-Z.AORUS"
winget "Easeware.DriverEasy"
winget "ElectronicArts.EADesktop"
winget "Elgato.StreamDeck"
winget "Elgato.WaveLink"
winget "EpicGames.EpicGamesLauncher"
winget "EPSON.EpsonConnectPrinterSetup"
winget "EPSON.EpsonScan2"
winget "EPSON.EventManager"
winget "EPSON.ScanSmart"
winget "GOG.Galaxy"
winget "GoLang.Go"
winget "Google.Chrome.EXE"
winget "Greenshot.Greenshot"
winget "HypixelStudios.Hytale"
winget "Inkscape.Inkscape"
winget "JanDeDobbeleer.OhMyPosh"
winget "LizardByte.Sunshine"
winget "Logitech.GHUB"
winget "Logitech.LogiTune"
winget "Mango3D.LycheeSlicer"
winget "Meta.Oculus"
winget "Microsoft.PowerShell"
winget "Microsoft.PowerToys"
winget "Microsoft.Teams"
winget "Microsoft.VisualStudio.2022.BuildTools"
winget "Microsoft.VisualStudioCode"
winget "Microsoft.WindowsTerminal"
winget "Modrinth.ModrinthApp"
winget "MoonlightGameStreamingProject.Moonlight"
winget "Muse.MuseHub"
winget "Notion.Notion"
winget "NZXT.CAM"
winget "OpenJS.NodeJS.LTS"
winget "OpenWhisperSystems.Signal"
winget "Opera.Opera"
winget "Overwolf.CurseForge"
winget "PostgreSQL.pgAdmin"
winget "Proton.ProtonVPN"
winget "PTRTECH.UVtools"
winget "Python.Launcher"
winget "Python.Python.3.10"
winget "Python.Python.3.12"
winget "Python.Python.3.13"
winget "Python.Python.3.14"
winget "Rainmeter.Rainmeter"
winget "RamenSoftware.Windhawk"
winget "RaspberryPiFoundation.RaspberryPiImager"
winget "Rclone.Rclone"
winget "Readdle.Spark"
winget "REALiX.HWiNFO"
winget "RevoUninstaller.RevoUninstallerPro"
winget "Rustlang.Rustup"
winget "SlackTechnologies.Slack"
winget "SoftFever.OrcaSlicer"
winget "Starship.Starship"
winget "SteelSeries.GG"
winget "SublimeHQ.SublimeText.4"
winget "Tailscale.Tailscale"
winget "TeamViewer.TeamViewer"
winget "Telegram.TelegramDesktop"
winget "Tencent.WeChat.Universal"
winget "Ubisoft.Connect"
winget "Valve.Steam"
winget "Valve.SteamLink"
winget "VideoLAN.VLC"
winget "ViGEm.ViGEmBus"
winget "VirtualDesktop.Streamer"
winget "Warp.Warp"
winget "winaero.tweaker"
winget "Zoom.Zoom.EXE"
winget "9NQ7512CXL7T", source: "msstore"
winget "XPFCKBRNFZQ62G", source: "msstore"
krew "browse-pvc"
krew "cnpg"
krew "krew"
krew "node-shell"
krew "rook-ceph"
npm "@google/gemini-cli"
npm "@openai/codex"
npm "any-buddy"
npm "beads-ui"
npm "corepack"
npm "mintlify"
npm "nodemon"
npm "openroom"
npm "pnpm"
npm "uipro-cli"
npm "yarn"
